verykingo/JJProject/J1_APP/STM8L/User/vkusart.c
/******************************************************************************
 * 文件  ：vkusart.c
 * 描述    ：STM8L串口，支持可配置缓存
 * 平台    ：STM8L
 * 时间  ：2019-04-01

*******************************************************************************/

/* 包含系统头文件 */
#include "stm8l15x.h"
#include "stdio.h"
#include "stdlib.h"
#include "string.h"

/* 包含自定义头文件 */
#include "vkusart.h"

/* 自定义新类型 */

/* 自定义宏 */
#define USART_SEND_RECV_TIMEOUT 1000		//发送接收超时

/* 全局变量定义 */
static uint8_t Usart1_TxBuffer[USART1_BUFFER_TX_SIZE] = {0};
static uint8_t Usart1_RxBuffer[USART1_BUFFER_RX_SIZE] = {0};

static uint8_t Usart2_TxBuffer[USART2_BUFFER_SIZE] = {0};
static uint8_t Usart2_RxBuffer[USART2_BUFFER_SIZE] = {0};

static uint8_t Usart3_TxBuffer[USART3_BUFFER_SIZE] = {0};
static uint8_t Usart3_RxBuffer[USART3_BUFFER_SIZE] = {0};

static vkUSART gUsart[3] = {0x00};

/* 标准库printf串口，调用putchar/getchar函数，串口无中断和DMA，使用查询方式 */
static USART_TypeDef* Usart_Printf = NULL;

/*******************************************************************************
 * 名称: vkUsart_Init
 * 功能: USART初始化操作
 * 形参: 串口USARTx, 波特率BaudRate
 * 返回: 成功0，失败-1
 * 说明: 1.支持波特率9600/115200/38400；
         2.支持中断方式和DMA方式发送和接收数据；
 ******************************************************************************/
int vkUsart_Init(vkCOM com, uint32_t baudrate, uint8_t* tx_buffer, uint8_t tx_bufsize, uint8_t* rx_buffer, uint8_t rx_bufsize)
{
	/* USART configured as follow:
	- BaudRate = 115200 baud  
	- Word Length = 8 Bits
	- One Stop Bit
	- No parity
	- Receive and transmit enabled
	- USART Clock enabled
	*/

	/* USART check */
	if(com!=COM1 && com!=COM2 && com!=COM3)
	{
		return -1;
	}	
	
	/* BaudRate check */
	if(baudrate!=9600 && baudrate!=115200 && baudrate!=230400)
	{
		return -1;
	}

	/* TX/RX Buffer Check */
	if(tx_buffer==NULL || rx_buffer==NULL || tx_bufsize==0 || rx_bufsize==0)
	{
		return -1;
	}
	if(tx_bufsize > USART_BUFFER_BLOCK_MAX_SIZE || rx_bufsize > USART_BUFFER_BLOCK_MAX_SIZE)
	{
		return -1;
	}

	if(com == COM1)
	{
		gUsart[com].usart = USART1;
		
		/* Enable USART clock */
		CLK_PeripheralClockConfig(CLK_Peripheral_USART1, ENABLE);

		/* USART1 Tx- Rx (PC3- PC2) remapping to (PA2- PA3) */
		#if 1
		/* GPIO重映射 */
		//SYSCFG_REMAPDeInit();
		SYSCFG_REMAPPinConfig(REMAP_Pin_USART1TxRxPortA, ENABLE);
		/* Configure USART Tx pin output*/
		GPIO_Init(GPIOA, GPIO_Pin_2, GPIO_Mode_Out_PP_High_Fast);
		/* Configure USART Rx pin input*/
		GPIO_Init(GPIOA, GPIO_Pin_3, GPIO_Mode_In_PU_No_IT);
		
		/* 是否使用内部上拉电阻 */
		GPIO_ExternalPullUpConfig(GPIOA, GPIO_Pin_2, ENABLE);
		GPIO_ExternalPullUpConfig(GPIOA, GPIO_Pin_3, ENABLE);
		#endif

		/* USART1 Tx- Rx (PC3- PC2) */
		#if 0
		/* Configure USART Tx pin output*/
		GPIO_Init(GPIOC, GPIO_Pin_3, GPIO_Mode_Out_PP_High_Fast);
		/* Configure USART Rx pin input*/
		GPIO_Init(GPIOC, GPIO_Pin_2, GPIO_Mode_In_PU_No_IT);
		
		/* 是否使用内部上拉电阻 */
		GPIO_ExternalPullUpConfig(GPIOC, GPIO_Pin_3, ENABLE);
		GPIO_ExternalPullUpConfig(GPIOC, GPIO_Pin_2, ENABLE);		
		#endif		

		/* USART1 Tx- Rx (PC3- PC2) remapping to (PC5- PC6) */
		#if 0
		/* GPIO重映射 */
		//SYSCFG_REMAPDeInit();
		SYSCFG_REMAPPinConfig(REMAP_Pin_USART1TxRxPortC, ENABLE);
		/* Configure USART Tx pin output*/
		GPIO_Init(GPIOC, GPIO_Pin_5, GPIO_Mode_Out_PP_High_Fast);
		/* Configure USART Rx pin input*/
		GPIO_Init(GPIOC, GPIO_Pin_6, GPIO_Mode_In_PU_No_IT);

		/* 是否使用内部上拉电阻 */
		GPIO_ExternalPullUpConfig(GPIOC, GPIO_Pin_5, ENABLE);
		GPIO_ExternalPullUpConfig(GPIOC, GPIO_Pin_6, ENABLE);
		#endif

		/* Configure Interupt Software Priority */
		//ITC_SetSoftwarePriority(USART1_TX_TIM5_UPD_OVF_TRG_BRK_IRQn, ITC_PriorityLevel_2);
		//ITC_SetSoftwarePriority(USART1_RX_TIM5_CC_IRQn, ITC_PriorityLevel_2);

		gUsart[com].tx_frame = 0;
		gUsart[com].tx_buffer.locked = 0;
		gUsart[com].rx_buffer.locked = 0;
		
		gUsart[com].tx_buffer.buffer = Usart1_TxBuffer;
		gUsart[com].rx_buffer.buffer = Usart1_RxBuffer;

		gUsart[com].tx_buffer.block_size = tx_bufsize;
		gUsart[com].rx_buffer.block_size = rx_bufsize;

		gUsart[com].tx_buffer.block_nums = (USART1_BUFFER_TX_SIZE/tx_bufsize<255)?(USART1_BUFFER_TX_SIZE/tx_bufsize):255;
		gUsart[com].rx_buffer.block_nums = (USART1_BUFFER_RX_SIZE/rx_bufsize<255)?(USART1_BUFFER_RX_SIZE/rx_bufsize):255;

		gUsart[com].tx_buffer.block_stored = 0;
		gUsart[com].rx_buffer.block_stored = 0;

		gUsart[com].tx_buffer.index_insert = 0;
		gUsart[com].rx_buffer.index_insert = 0;
		
		gUsart[com].tx_buffer.index_delete = 0;
		gUsart[com].rx_buffer.index_delete = 0;
	}
	else if(com == COM2)
	{
		gUsart[com].usart = USART2;
		
		/* Enable USART clock */
		CLK_PeripheralClockConfig(CLK_Peripheral_USART2, ENABLE);

		/* Configure USART Tx pin output*/
		GPIO_Init(GPIOE, GPIO_Pin_4, GPIO_Mode_Out_PP_High_Fast);

		/* Configure USART Rx pin input*/
		GPIO_Init(GPIOE, GPIO_Pin_3, GPIO_Mode_In_PU_No_IT);

		/* 是否使用内部上拉电阻 */
		GPIO_ExternalPullUpConfig(GPIOE, GPIO_Pin_4, ENABLE);
		GPIO_ExternalPullUpConfig(GPIOE, GPIO_Pin_3, ENABLE);

		/* Configure Interupt Software Priority */
		ITC_SetSoftwarePriority(TIM2_UPD_OVF_TRG_BRK_USART2_TX_IRQn, ITC_PriorityLevel_2);
		ITC_SetSoftwarePriority(TIM2_CC_USART2_RX_IRQn, ITC_PriorityLevel_2);

		gUsart[com].tx_frame = 0;
		gUsart[com].tx_buffer.locked = 0;
		gUsart[com].rx_buffer.locked = 0;
		
		gUsart[com].tx_buffer.buffer = Usart2_TxBuffer;
		gUsart[com].rx_buffer.buffer = Usart2_RxBuffer;

		gUsart[com].tx_buffer.block_size = tx_bufsize;
		gUsart[com].rx_buffer.block_size = rx_bufsize;

		gUsart[com].tx_buffer.block_nums = (USART2_BUFFER_SIZE/tx_bufsize<255)?(USART2_BUFFER_SIZE/tx_bufsize):255;
		gUsart[com].rx_buffer.block_nums = (USART2_BUFFER_SIZE/rx_bufsize<255)?(USART2_BUFFER_SIZE/rx_bufsize):255;

		gUsart[com].tx_buffer.block_stored = 0;
		gUsart[com].rx_buffer.block_stored = 0;

		gUsart[com].tx_buffer.index_insert = 0;
		gUsart[com].rx_buffer.index_insert = 0;
		
		gUsart[com].tx_buffer.index_delete = 0;
		gUsart[com].rx_buffer.index_delete = 0;
	}
	else if(com == COM3)
	{
		gUsart[com].usart = USART3;

