verykingo/JJProject/J1_APP/STM8L/User/vkusart.c
		/* USART3 Tx- Rx (PE6- PE7) */
		
		/* Enable USART clock */
		CLK_PeripheralClockConfig(CLK_Peripheral_USART3, ENABLE);

		/* Configure USART Tx pin output*/
		GPIO_Init(GPIOE, GPIO_Pin_6, GPIO_Mode_Out_PP_High_Fast);

		/* Configure USART Rx pin input*/
		GPIO_Init(GPIOE, GPIO_Pin_7, GPIO_Mode_In_PU_No_IT);	

		/* 是否使用内部上拉电阻 */
		GPIO_ExternalPullUpConfig(GPIOE, GPIO_Pin_6, ENABLE);
		GPIO_ExternalPullUpConfig(GPIOE, GPIO_Pin_7, ENABLE);

		/* Configure Interupt Software Priority */
		ITC_SetSoftwarePriority(TIM3_UPD_OVF_TRG_BRK_USART3_TX_IRQn, ITC_PriorityLevel_2);
		ITC_SetSoftwarePriority(TIM3_CC_USART3_RX_IRQn, ITC_PriorityLevel_2);
		
		gUsart[com].tx_frame = 0;
		gUsart[com].tx_buffer.locked = 0;
		gUsart[com].rx_buffer.locked = 0;

		gUsart[com].tx_buffer.buffer = Usart3_TxBuffer;
		gUsart[com].rx_buffer.buffer = Usart3_RxBuffer;

		gUsart[com].tx_buffer.block_size = tx_bufsize;
		gUsart[com].rx_buffer.block_size = rx_bufsize;

		gUsart[com].tx_buffer.block_nums = (USART3_BUFFER_SIZE/tx_bufsize<255)?(USART3_BUFFER_SIZE/tx_bufsize):255;
		gUsart[com].rx_buffer.block_nums = (USART3_BUFFER_SIZE/rx_bufsize<255)?(USART3_BUFFER_SIZE/rx_bufsize):255;

		gUsart[com].tx_buffer.block_stored = 0;
		gUsart[com].rx_buffer.block_stored = 0;

		gUsart[com].tx_buffer.index_insert = 0;
		gUsart[com].rx_buffer.index_insert = 0;
		
		gUsart[com].tx_buffer.index_delete = 0;
		gUsart[com].rx_buffer.index_delete = 0;
	}
	else
	{
		return -1;
	}

	/* Disable USART */
	USART_Cmd(gUsart[com].usart, DISABLE);

	/* RESET USART */
  	USART_DeInit(gUsart[com].usart);

  	/* USART configuration */
  	USART_Init(gUsart[com].usart, baudrate, USART_WordLength_8b, USART_StopBits_1, USART_Parity_No, (USART_Mode_TypeDef)(USART_Mode_Tx|USART_Mode_Rx));	

	/* 如果串口非标准库函数prinft串口，配置中断方式 */
	if(gUsart[com].usart != Usart_Printf)
	{
	  	/* Enable the USART Receive interrupt: this interrupt is generated 
	  	   when the USART receive data register is not empty */
	 	USART_ITConfig(gUsart[com].usart, USART_IT_RXNE, ENABLE);

		/* Enable the USART Transmit complete interrupt: this interrupt is 
		   generated when the USART transmit Shift Register is empty */
		USART_ClearITPendingBit(gUsart[com].usart, USART_IT_TC);
	  	USART_ITConfig(gUsart[com].usart, USART_IT_TC, ENABLE);	

		/* Enable the USART IDLE line interrupt */
		//USART_ClearITPendingBit(gUsart[com].usart, USART_IT_IDLE);
	  	USART_ITConfig(gUsart[com].usart, USART_IT_IDLE, ENABLE);	
	}
	
	/* Enable USART */
	USART_Cmd(gUsart[com].usart, ENABLE);

	/* Set Zero */
	gUsart[com].tx_data = tx_buffer;
	gUsart[com].rx_data = rx_buffer;
	gUsart[com].tx_size = tx_bufsize;
	gUsart[com].rx_size = rx_bufsize;
	gUsart[com].tx_index = 0;
	gUsart[com].rx_index = 0;	
	gUsart[com].tx_count = 0;
	gUsart[com].rx_count = 0;	
	gUsart[com].tx_doing = 0;
	gUsart[com].rx_idle = 0;

	/* Configure DMA channel */
	gUsart[com].dma_enable = 0;
	gUsart[com].tx_channel = NULL;
	gUsart[com].rx_channel = NULL;

	/* DMA Configure */
	/* 串口非标准库函数prinft串口，才需要配置DMA方式 */
	if(com == COM1 && gUsart[com].usart != Usart_Printf)
	{
		if(gUsart[COM3].dma_enable == 0)
		{
		 	#if (UART1_DMA_ENABLE == 1u)

			/* Disable RXNE and TC  */
			USART_ITConfig(gUsart[com].usart, USART_IT_RXNE, DISABLE);
			USART_ITConfig(gUsart[com].usart, USART_IT_TC, DISABLE);	
			
			/* 开始配置DMA设置 */
			gUsart[com].dma_enable = 1;
			gUsart[com].tx_channel = DMA1_Channel1;
			gUsart[com].rx_channel = DMA1_Channel2;

			/* Enable The DMA controller clock */
			CLK_PeripheralClockConfig(CLK_Peripheral_DMA1, ENABLE);

			/* Disable the USART Tx/Rx DMA channel */
			DMA_Cmd(gUsart[com].tx_channel, DISABLE);
			DMA_Cmd(gUsart[com].rx_channel, DISABLE);

			/* Deintialize DMA channels */
			DMA_DeInit(gUsart[com].tx_channel);
			DMA_DeInit(gUsart[com].rx_channel);
			
			/* Intialize DMA channels */
			DMA_Init(gUsart[com].tx_channel, (uint32_t)gUsart[com].tx_data, (uint16_t)&gUsart[com].usart->DR, gUsart[com].tx_size, DMA_DIR_MemoryToPeripheral, DMA_Mode_Normal, DMA_MemoryIncMode_Inc, DMA_Priority_VeryHigh, DMA_MemoryDataSize_Byte);
			DMA_Init(gUsart[com].rx_channel, (uint32_t)gUsart[com].rx_data, (uint16_t)&gUsart[com].usart->DR, gUsart[com].rx_size, DMA_DIR_PeripheralToMemory, DMA_Mode_Normal, DMA_MemoryIncMode_Inc, DMA_Priority_VeryHigh, DMA_MemoryDataSize_Byte);
			
			/* DMA_ITConfig */
			DMA_ClearFlag(DMA1_FLAG_TC1);			
			DMA_ITConfig(gUsart[com].tx_channel, DMA_ITx_TC, ENABLE);
			
			ITC_SetSoftwarePriority(DMA1_CHANNEL0_1_IRQn, ITC_PriorityLevel_2);	//发送通道降优先级
			ITC_SetSoftwarePriority(DMA1_CHANNEL2_3_IRQn, ITC_PriorityLevel_2); //接收通道降优先级

			/* Enable the USART Tx/Rx DMA requests */		
			USART_DMACmd(gUsart[com].usart, USART_DMAReq_TX, ENABLE);
			USART_DMACmd(gUsart[com].usart, USART_DMAReq_RX, ENABLE);

			/* Global DMA Enable */
			DMA_GlobalCmd(ENABLE);
			
			#endif
		}
	}
	else if(com == COM3 && gUsart[com].usart != Usart_Printf)
	{
		if(gUsart[COM1].dma_enable == 0)
		{
		 	#if (UART3_DMA_ENABLE == 1u)

			/* Disable RXNE and TC  */
			USART_ITConfig(gUsart[com].usart, USART_IT_RXNE, DISABLE);
			USART_ITConfig(gUsart[com].usart, USART_IT_TC, DISABLE);	
			
			/* 开始配置DMA设置 */
			gUsart[com].dma_enable = 1;
			gUsart[com].tx_channel = DMA1_Channel1;
			gUsart[com].rx_channel = DMA1_Channel2;

			/* Enable The DMA controller clock */
			CLK_PeripheralClockConfig(CLK_Peripheral_DMA1, ENABLE);

			/* Disable the USART Tx/Rx DMA channel */
			DMA_Cmd(gUsart[com].tx_channel, DISABLE);
			DMA_Cmd(gUsart[com].rx_channel, DISABLE);

			/* Deintialize DMA channels */
			DMA_DeInit(gUsart[com].tx_channel);
			DMA_DeInit(gUsart[com].rx_channel);
			
			/* Intialize DMA channels */
			DMA_Init(gUsart[com].tx_channel, (uint32_t)gUsart[com].tx_data, (uint16_t)&gUsart[com].usart->DR, gUsart[com].tx_size, DMA_DIR_MemoryToPeripheral, DMA_Mode_Normal, DMA_MemoryIncMode_Inc, DMA_Priority_VeryHigh, DMA_MemoryDataSize_Byte);
			DMA_Init(gUsart[com].rx_channel, (uint32_t)gUsart[com].rx_data, (uint16_t)&gUsart[com].usart->DR, gUsart[com].rx_size, DMA_DIR_PeripheralToMemory, DMA_Mode_Normal, DMA_MemoryIncMode_Inc, DMA_Priority_VeryHigh, DMA_MemoryDataSize_Byte);
			
			/* DMA_ITConfig */
			DMA_ClearFlag(DMA1_FLAG_TC1);			
			DMA_ITConfig(gUsart[com].tx_channel, DMA_ITx_TC, ENABLE);
			
			ITC_SetSoftwarePriority(DMA1_CHANNEL0_1_IRQn, ITC_PriorityLevel_2);
			ITC_SetSoftwarePriority(DMA1_CHANNEL2_3_IRQn, ITC_PriorityLevel_2); 

			/* Enable the USART Tx/Rx DMA requests */		
			USART_DMACmd(gUsart[com].usart, USART_DMAReq_TX, ENABLE);
			USART_DMACmd(gUsart[com].usart, USART_DMAReq_RX, ENABLE);

