verykingo/JJProject/J1_APP/STM8L/User/vkusart.c
	/* Loop until the Read data register flag is SET or timeout */  
  	while (USART_GetFlagStatus(Usart_Printf, USART_FLAG_RXNE) == RESET && --recv_timeout);

	/* timeout return -1 */
	if(recv_timeout == 0)
	{
		return -1;
	}

	c = (int)USART_ReceiveData8(Usart_Printf);  

	return c;
}

/*
 * 接收一个字节数据完成中断处理函数
 */
int vkUsart_INT_Recv_Byte_Over_Handler(vkCOM com)
{
	int ret = 0;

	/* 一帧数据接收未完成，持续取数据 */
	if(gUsart[com].rx_idle == 0 && gUsart[com].rx_count < gUsart[com].rx_size)
	{
		gUsart[com].rx_data[gUsart[com].rx_index++] = USART_ReceiveData8(gUsart[com].usart);
		gUsart[com].rx_count++;
	}
	else
	{
		ret = -1;
	}

	return ret;
}

/*
 * DMA和中断接收一帧数据完成中断处理函数
 */
int vkUsart_Recv_Line_Handler(vkCOM com)
{	
	int ret = -1;
	int size = 0;
	int full = 0;
	uint8_t data[USART_BUFFER_BLOCK_MAX_SIZE] = {0};

	if(gUsart[com].dma_enable == 1)
	{
		/* 接收数据 */
		size = vkUsart_DMA_Recv(com, data+1, USART_BUFFER_BLOCK_MAX_SIZE-1);
		data[0] = size;
	}
	else
	{
		/* 接收数据 */
		size = vkUsart_INT_Recv(com, data+1, USART_BUFFER_BLOCK_MAX_SIZE-1);
		data[0] = size;
	}

	/* 插入缓存 */
	if(size > 0)
	{
		ret = vkUsart_Buffer_Insert(&gUsart[com].rx_buffer, data, size+1);
	}
	
	full = vkUsart_Buffer_Full(&gUsart[com].rx_buffer);

	if(ret == 0)
	{
		ret = size;
	}

	if(full == 1)
	{
		/* 插入缓存数据后，缓存已满，则说明不能再接收数据，需要停止 */
		/* 停止数据接收 */
		if(gUsart[com].dma_enable == 1)
		{
			/* 关闭DMA通道 */
			DMA_Cmd(gUsart[com].rx_channel, DISABLE); 

			/* 关IDLE中断 */	
			USART_ITConfig(gUsart[com].usart, USART_IT_IDLE, DISABLE);	
		}
		else
		{
			/* 关字节接收中断 */
			USART_ITConfig(gUsart[com].usart, USART_IT_RXNE, DISABLE);

			/* 关IDLE中断 */		
			USART_ITConfig(gUsart[com].usart, USART_IT_IDLE, DISABLE);			
		}
	}
	
	return 0;
}

/*
 * 发送一个字节完成中断处理函数
 */
int vkUsart_INT_Send_Byte_Over_Handler(vkCOM com)
{
	/* 逐字节发送数据 */
	if(gUsart[com].tx_index < gUsart[com].tx_count)
	{
		/* Write a character to the USART */	
		USART_SendData8(gUsart[com].usart, gUsart[com].tx_data[gUsart[com].tx_index++]);

		gUsart[com].tx_doing = 1;
	}
	/* 数据发送完成 */
	else
	{	
		/* 一帧数据发送完成，停止中断字节发送数据 */
		gUsart[com].tx_doing = 0;

		/* 一帧数据发送完成，取下一帧数据 */
		vkUsart_INT_Send_Line_Over_Handler(com);
	}	

	return 0;
}

int vkUsart_INT_Send(vkCOM com, uint8_t *buf, int size)
{
	int ret = -1;	

	/* 复制数据到发送缓存 */
	ret = (size>gUsart[com].tx_size)?gUsart[com].tx_size:size;
	memcpy(gUsart[com].tx_data, buf, ret);

	/* 开始发生数据 */
	gUsart[com].tx_count = ret;
	gUsart[com].tx_index = 0;

	/* 如果没有正在发送字节数据 */
	if(gUsart[com].tx_doing == 0)
	{		
		vkUsart_INT_Send_Byte_Over_Handler(com);
	}
	
	return ret;
}

int vkUsart_INT_Recv(vkCOM com, uint8_t *buf, int size)
{
	int ret = -1;

	gUsart[com].rx_idle  = 1;
	USART_ITConfig(gUsart[com].usart, USART_IT_RXNE, DISABLE);

	/* 复制已经收到的一帧数据 */
	ret = (size>gUsart[com].rx_count)?gUsart[com].rx_count:size;
	memcpy(buf, gUsart[com].rx_data, ret);

	/* 重新计算收到的数据 */
	gUsart[com].rx_index = 0; 
	gUsart[com].rx_count = 0;
	gUsart[com].rx_idle  = 0;
	USART_ITConfig(gUsart[com].usart, USART_IT_RXNE, ENABLE);

	return ret;
}

/*******************************************************************************
 * 名称: vkUsart_DMA_Send
 * 功能: 发送字符串
 * 形参: 字符串指针buf,字符串大小size
 * 返回: -1超时，成功发送字符串大小
 * 说明: 无 
 ******************************************************************************/
int vkUsart_DMA_Send(vkCOM com, uint8_t *buf, int size)
{	
	int ret = -1;

	DMA_Cmd(gUsart[com].tx_channel, DISABLE); 

	/* Copy data to Tx Channel */
	ret = (size<gUsart[com].tx_size)?size:gUsart[com].tx_size;
	memcpy(gUsart[com].tx_data, buf, ret);

	DMA_SetCurrDataCounter(gUsart[com].tx_channel, ret); 
	DMA_Cmd(gUsart[com].tx_channel, ENABLE);	
	
	return ret;
}

/*******************************************************************************
 * 名称: vkUsart_DMA_Recv
 * 功能: 接收字符串
 * 形参: 字符串指针buf,字符串大小size
 * 返回: 成功接收字符串大小
 * 说明: 无 
 ******************************************************************************/
int vkUsart_DMA_Recv(vkCOM com, uint8_t *buf, int size)
{
	int ret = -1;

	DMA_Cmd(gUsart[com].rx_channel, DISABLE); 

	/* 获取接收数据大小并复制数据 */
	int len = gUsart[com].rx_size-DMA_GetCurrDataCounter(gUsart[com].rx_channel);
	ret = (len<size)?len:size;
	memcpy(buf, gUsart[com].rx_data, ret);

	/* 准备下一次接收数据 */
	DMA_SetCurrDataCounter(gUsart[com].rx_channel, gUsart[com].rx_size); 
	DMA_Cmd(gUsart[com].rx_channel, ENABLE);

	return ret;	
}

/*
 * DAM发送完成中断处理函数
 */
int vkUsart_DMA_Send_Line_Over_Handler(vkCOM com)
{
	int ret = -1;
	uint8_t data[USART_BUFFER_BLOCK_MAX_SIZE] = {0};

	/* 删除一帧缓存数据 */
	ret = vkUsart_Buffer_Delete(&gUsart[com].tx_buffer, data, USART_BUFFER_BLOCK_MAX_SIZE);

	if(ret == 0)
	{
		/* 成功从发送缓存删除一帧数据，发送数据 */
		ret = data[0];
		vkUsart_DMA_Send(com, data+1, ret);

		gUsart[com].tx_frame = 1;
	}
	else
	{
		gUsart[com].tx_frame = 0;
	}

	return ret;
}

int vkUsart_INT_Send_Line_Over_Handler(vkCOM com)
{
	int ret = -1;
	uint8_t data[USART_BUFFER_BLOCK_MAX_SIZE] = {0};

	/* 删除一帧缓存数据 */
	ret = vkUsart_Buffer_Delete(&gUsart[com].tx_buffer, data, USART_BUFFER_BLOCK_MAX_SIZE);

	if(ret == 0)
	{
		/* 成功从发送缓存删除一帧数据，发送数据 */
		ret = data[0];
		vkUsart_INT_Send(com, data+1, ret);

		gUsart[com].tx_frame = 1;
	}
	else
	{
		gUsart[com].tx_frame = 0;
	}

	return ret;	
}

/*******************************************************************************
 * 名称: vkUsart_Send
 * 功能: 发送字符串
 * 形参: 字符串指针buf,字符串大小size
 * 返回: 成功发送字符串大小
 * 说明: 无 
 ******************************************************************************/
int vkUsart_Send(vkCOM com, uint8_t *buf, int size)
{
	/* 参数检查 */
	if(com != COM1 && com != COM2 && com != COM3)
	{
		return -1;
	}

	if(buf == NULL || size <= 0)
	{	
		return -1;
	}

	int ret = -1;
	uint8_t data[USART_BUFFER_BLOCK_MAX_SIZE] = {0};

	memcpy(data+1, buf, (size<USART_BUFFER_BLOCK_MAX_SIZE-1)?size:USART_BUFFER_BLOCK_MAX_SIZE-1);
	data[0] = size;

