verykingo/JJProject/J1_APP/STM8L/User/vkusart.c
	/* 插入数据到发送缓存 */
	ret = vkUsart_Buffer_Insert(&gUsart[com].tx_buffer, data, size+1);
	
	if(ret == 0)
	{
		/* 插入数据到发送缓存成功 */
		ret = size;
	}

	if(gUsart[com].tx_frame == 0)
	{
		
		/* 插入数据到发送缓存后，检查已经停止了发送数据，手动发送一帧数据 */
		if(gUsart[com].dma_enable == 1)
		{
			vkUsart_DMA_Send_Line_Over_Handler(com);
		}
		else
		{
			vkUsart_INT_Send_Line_Over_Handler(com);
		}
	}

	return ret;
}

/*******************************************************************************
 * 名称: vkUsart_Recv
 * 功能: 接收字符串
 * 形参: 字符串指针buf,字符串大小size
 * 返回: 成功接收字符串大小/成功返回0
 * 说明: 无 
 ******************************************************************************/
int vkUsart_Recv(vkCOM com, uint8_t *buf, int size)
{
	/* 参数检查 */
	if(com != COM1 && com != COM2 && com != COM3)
	{
		return -1;
	}

	if(buf == NULL || size <= 0)
	{	
		return -1;
	}

	int ret = -1;
	int full = 0;
	uint8_t data[USART_BUFFER_BLOCK_MAX_SIZE] = {0};

	/* 接收队列是否满 */
	full = vkUsart_Buffer_Full(&gUsart[com].rx_buffer);

	/* 删除缓存数据，期间不允许进入IDLE中断插入数据 */
	ret = vkUsart_Buffer_Delete(&gUsart[com].rx_buffer, data, USART_BUFFER_BLOCK_MAX_SIZE);
			
	if(ret == 0)
	{
		/* 删除缓存数据成功，复制数据 */
		size = data[0];
		memcpy(buf, data+1, size);

		ret = size;
	}

	if(full == 1)	
	{
		/* 删除缓存数据前，缓存已满，则说明接收数据已经停止，需要重新开启 */
		/* 开启数据接收 */
		if(gUsart[com].dma_enable == 1)
		{
			/* 准备下一次接收数据 */
			DMA_Cmd(gUsart[com].rx_channel, DISABLE); 
			DMA_SetCurrDataCounter(gUsart[com].rx_channel, gUsart[com].rx_size); 
    		DMA_Cmd(gUsart[com].rx_channel, ENABLE);

			/* 开IDLE中断 */	
			USART_ITConfig(gUsart[com].usart, USART_IT_IDLE, ENABLE);	
		}
		else
		{
			/* 准备下一次接收数据 */
			gUsart[com].rx_index = 0;	
			gUsart[com].rx_count = 0;
			USART_ITConfig(gUsart[com].usart, USART_IT_RXNE, ENABLE);

			/* 开IDLE中断 */		
			USART_ITConfig(gUsart[com].usart, USART_IT_IDLE, ENABLE);			
		}
	}

	return ret;
}

/* 数据缓存插入数据块 */
inline int vkUsart_Buffer_Insert(vkUBuffer *ubuf, uint8_t *data, uint16_t len)
{
	if(ubuf->locked == 1)
	{	
		/* 缓存空间正在操作，插入失败 */
		return -1;
	}

	/* 锁定缓存空间 */
	ubuf->locked = 1;

	/* 缓存空间已满 */
	if(ubuf->block_stored == ubuf->block_nums)
	{

		/* 解锁缓存空间 */
		ubuf->locked = 0;
		
		return -1;
	}
	
	/* 先清零 */
	memset(ubuf->buffer + ubuf->index_insert*ubuf->block_size, 0, ubuf->block_size);
	
	/* 插入数据 */
	memcpy(ubuf->buffer + ubuf->index_insert*ubuf->block_size, data, (len<ubuf->block_size)?len:ubuf->block_size);

	/* 插入索引加1 */
	ubuf->index_insert = (ubuf->index_insert+1)%(ubuf->block_nums);

	/* 已存块数加1 */
	ubuf->block_stored = ubuf->block_stored+1;

	/* 解锁缓存空间 */
	ubuf->locked = 0;
	
	return 0;
}

/* 数据缓存取出数据块 */
inline int vkUsart_Buffer_Delete(vkUBuffer *ubuf, uint8_t *data, uint16_t len)
{
	if(ubuf->locked == 1)
	{	
		/* 缓存空间正在操作，插入失败 */
		return -1;
	}

	/* 锁定缓存空间 */
	ubuf->locked = 1;

	/* 缓存空间无数据 */
	if(ubuf->block_stored == 0)
	{
		/* 解锁缓存空间 */
		ubuf->locked = 0;
		
		return -1;
	}

	/* 取出数据 */
	memcpy(data, ubuf->buffer + ubuf->index_delete*ubuf->block_size, (len<ubuf->block_size)?len:ubuf->block_size);

	/* 删除索引加1 */
	ubuf->index_delete = (ubuf->index_delete+1)%(ubuf->block_nums);

	/* 已存块数减1 */
	ubuf->block_stored = ubuf->block_stored-1;

	/* 解锁缓存空间 */
	ubuf->locked = 0;
	
	return 0;
}

/* 是否空 */
inline int vkUsart_Buffer_Null(vkUBuffer *ubuf)
{
	return (ubuf->block_stored==0)?1:0;
}

/* 是否满 */
inline int vkUsart_Buffer_Full(vkUBuffer *ubuf)
{
	return (ubuf->block_stored==ubuf->block_nums)?1:0;
}

